{
  "title": "Terms of Service",
  "effective-date": "Effective Date: May 28, 2025 JST",
  "intro": "Welcome to PlaylistWizard (“we”, “us”, “our”). These Terms of Service (“Terms”) govern your use of the PlaylistWizard web application (“App”).",
  "privacy-policy": "By accessing or using the App, you agree to be bound by these Terms and our <1>Privacy Policy</1>. If you do not agree to these Terms or the Privacy Policy, you May not use the App.",
  "acceptance": {
    "title": "1. Acceptance of Terms",
    "content-1": "The App uses YouTube API Services and Spotify API Services. By using the App, you agree to the Terms of Service of:",
    "content-2": "If you do not agree with any part of these Terms, you may not use the App.",
    "youtube-terms": "<1>YouTube Terms of Service</1>",
    "google-privacy": "<1>Google Privacy Policy</1>",
    "spotify-terms": "<1>Spotify Terms of Service</1>",
    "spotify-privacy": "<1>Spotify Privacy Policy</1>"
  },
  "limitation": {
    "title": "2. Limitation of Liability",
    "content": "We are not liable for any damages, losses, or consequences resulting from the use of the App. Use of the App is entirely at your own risk."
  },
  "apis": {
    "title": "3. Music Service APIs",
    "youtube": {
      "title": "3.1 YouTube Data API",
      "content": "The App uses the YouTube Data API v3 to manage your playlists. It is not affiliated with YouTube or Google. We do not collect, store, or refresh any YouTube API data on our servers. Operations such as adding, deleting, and updating playlists are executed via the YouTube API to enable playlist management."
    },
    "spotify": {
      "title": "3.2 Spotify Web API",
      "content": "The App uses the Spotify Web API to manage your Spotify playlists and content. It is not affiliated with Spotify. No Spotify API data is collected, stored, or refreshed on our servers. Features include playlist creation, tracking, management, and music discovery."
    }
  },
  "revoke": {
    "title": "4. How to Revoke Access",
    "youtube": {
      "title": "4.1 YouTube Permissions",
      "content": "Clicking the \"Sign out\" button revokes YouTube permissions. You can also manage access via: <1>https://myaccount.google.com/permissions</1>"
    },
    "spotify": {
      "title": "4.2 Spotify Permissions",
      "content": "Clicking the \"Sign out\" button revokes Spotify permissions. You can also manage access via: <1>https://www.spotify.com/account/apps/</1>"
    }
  },
  "update": {
    "title": "5. Update and Changes",
    "content": "We reserve the right to modify or discontinue the App at any time without notice. We may update these Terms from time to time. Updates become effective upon posting."
  },
  "governing-law": {
    "title": "6. Governing Law",
    "content": "These Terms are governed by the laws of Japan. Any disputes arising from these Terms shall fall under the exclusive jurisdiction of the courts of Japan."
  }
}